In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('phone_data.csv')

In [3]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [4]:
df.tail(5)

     index            date  duration  item    month   network network_type
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

In [5]:
#gives mathematical measures from the dataset
df.describe()

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

In [6]:
df.count()

index           830
date            830
duration        830
item            830
month           830
network         830
network_type    830
dtype: int64

In [7]:
df.min()

index                       0
date            1/1/2015 6:58
duration                    1
item                     call
month                 2014-11
network                Meteor
network_type             data
dtype: object

In [8]:
#How many rows the dataset
df['item'].count()

830

In [9]:
#What was the longest phone call / data entry?
df['duration'].max()

10528.0

In [11]:
#How many seconds of phone calls are recorded in total?
df['duration'][df['item']=='call'].sum(axis=0)

92321.0

In [12]:
#How many entries are there for each month?
df['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [56]:
#Get the number of dates / entries in each month
df.groupby('month')['duration'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: duration, dtype: int64

In [19]:
#different networks in the dataset
df['network'].unique()

array(['data', 'Vodafone', 'Meteor', 'Tesco', 'Three', 'voicemail',
       'landline', 'special', 'world'], dtype=object)

In [20]:
#Create groups based on months
df.groupby("month").groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [21]:
#How many number of non-null unique network entries?
df['network'].nunique()

9

In [25]:
#all the columns in the dataset
df.columns

Index(['index', 'date', 'duration', 'item', 'month', 'network',
       'network_type'],
      dtype='object')

In [39]:
#Count of items in the month 2014-11
len(df.groupby('month').groups['2014-11'])

230

In [47]:
#Find the sum of ‘duration’ in month?
df.groupby('month').agg({"duration": "sum"})

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [43]:
#Get the sum of the durations per month
df.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [58]:
#Get the first entry for each month  
df.groupby('month').first()

         index             date  duration  item   network network_type
month
2014-11      0   15/10/14 06:58    34.429  data      data         data
2014-12    228   13/11/14 06:58    34.429  data      data         data
2015-01    381   13/12/14 06:58    34.429  data      data         data
2015-02    577   13/01/15 06:58    34.429  data      data         data
2015-03    729  12/2/2015 20:15    69.000  call  landline     landline

In [49]:
#Group the data frame by month and item and extract a number of stats from each group
(df.groupby(['month', 'item']).agg({'duration':"sum",      # find the sum of the durations for each group
                                   'network_type': "count", # find the number of network type entries
                                    'date': 'first'}))

               duration  network_type             date
month   item
2014-11 call  25547.000           107   15/10/14 06:58
        data    998.441            29   15/10/14 06:58
        sms      94.000            94   16/10/14 22:18
2014-12 call  13561.000            79   14/11/14 17:24
        data   1032.870            30   13/11/14 06:58
        sms      48.000            48   14/11/14 17:28
2015-01 call  17070.000            88   15/12/14 20:03
        data   1067.299            31   13/12/14 06:58
        sms      86.000            86   15/12/14 19:56
2015-02 call  14416.000            67   15/01/15 10:36
        data   1067.299            31   13/01/15 06:58
        sms      39.000            39   15/01/15 12:23
2015-03 call  21727.000            47  12/2/2015 20:15
        data    998.441            29   13/02/15 06:58
        sms      25.000            25   19/02/15 18:46

In [51]:
df.groupby(['month', 'item']).agg({'duration':"sum"})

               duration
month   item
2014-11 call  25547.000
        data    998.441
        sms      94.000
2014-12 call  13561.000
        data   1032.870
        sms      48.000
2015-01 call  17070.000
        data   1067.299
        sms      86.000
2015-02 call  14416.000
        data   1067.299
        sms      39.000
2015-03 call  21727.000
        data    998.441
        sms      25.000

In [53]:
#How many calls, texts, and data are sent per month, split by network_type?
df.groupby(['month', 'network_type'])['duration'].count()

month    network_type
2014-11  data             29
         landline          5
         mobile          189
         special           1
         voicemail         6
2014-12  data             30
         landline          7
         mobile          108
         voicemail         8
         world             4
2015-01  data             31
         landline         11
         mobile          160
         voicemail         3
2015-02  data             31
         landline          8
         mobile           90
         special           2
         voicemail         6
2015-03  data             29
         landline         11
         mobile           54
         voicemail         4
         world             3
Name: duration, dtype: int64

In [54]:
#What is the sum of durations, for calls only, to each network?
df[df['item'] == 'call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [60]:
#How many calls, sms, and data entries are in each month?
df.groupby(['month', 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [61]:
df.groupby(['month', 'item']).agg({'duration': ['min', 'max', 'sum'],      # find the min, max, and sum of the duration column
                                    'network_type': "count", # find the number of network type entries
                                    'date': 'first'})

             duration                       network_type             date
                  min        max        sum        count            first
month   item
2014-11 call    1.000   1940.000  25547.000          107   15/10/14 06:58
        data   34.429     34.429    998.441           29   15/10/14 06:58
        sms     1.000      1.000     94.000           94   16/10/14 22:18
2014-12 call    2.000   2120.000  13561.000           79   14/11/14 17:24
        data   34.429     34.429   1032.870           30   13/11/14 06:58
        sms     1.000      1.000     48.000           48   14/11/14 17:28
2015-01 call    2.000   1859.000  17070.000           88   15/12/14 20:03
        data   34.429     34.429   1067.299           31   13/12/14 06:58
        sms     1.000      1.000     86.000           86   15/12/14 19:56
2015-02 call    1.000   1863.000  14416.000           67   15/01/15 10:36
        data   34.429     34.429   1067.299           31   13/01/15 06:58
        sms     1.000      1.000     39.000           39   15/01/15 12:23
2015-03 call    2.000  10528.000  21727.000           47  12/2/2015 20:15
        data   34.429     34.429    998.441           29   13/02/15 06:58
        sms     1.000      1.000     25.000           25   19/02/15 18:46